brew "age"
brew "libnotify"
brew "ncdu"
brew "nvim"
brew "gcc"
brew "npm"
brew "gh"
brew "jsonlint"
brew "jq"
brew "ag"
# need this because the version in repos is too old and there are compatibility issues b/c of course there are
brew "gnupg"
brew "rsc_2fa"
brew "tmux"
brew "bat"
brew "btop"
brew "python3"
brew "pylint"
brew "mypy"
brew "rust"
brew "stylua"
